//Передача параметров в функцию по ссылке. Разница между ссылкой и указателем. Урок #51 - Видео №62.

#include<iostream>
using namespace std;

/*
Ссылка в варианте foo2 сразу ссылается на данные, и нам у же не надо делать оепрация раземинования (&) в отличии
от римера foo3 - где вызвав данную функцию нам необходимо прописывать амперсант (&), что в принципе
в некоторых а то и во многих удобнее и быстрее и более безопасней (но и указатели всровно не менее важны и тоже используюся).
*/

//---------------------------------------------------------------------------------------------------------
void foo1(int a)
{
	a = 1;
}
//---------------------------------------------------------------------------------------------------------
void foo2(int &a) // Передача параметра по ссылке.
{
	a = 2;
}
//---------------------------------------------------------------------------------------------------------
void foo3(int *a) // Передача параметра по указателю.
{
	*a = 3;
}
//---------------------------------------------------------------------------------------------------------
void main()
{
	setlocale(LC_ALL, "Ru");

	cout << "==============" << endl;
	cout << "Изначально проинизиализированные данные:" << endl
		 << "int value = 5;" << endl;

	cout << "==============" << endl;
	int value = 5;
	cout << "value = " << value << endl;
	cout << "==============" << endl;
	foo1(value);
	cout << "foo1 = " << value << endl;
	cout << "==============" << endl;
	foo2(value);
	cout << "foo2 = " << value << endl;
	cout << "==============" << endl;
	foo3(&value);
	cout << "foo3 = " << value << endl;
	cout << "==============" << endl;
}
//---------------------------------------------------------------------------------------------------------