//Указатель на функцию в качестве параметра. Передача функции в качестве параметра. С++ Урок #65 - Видео №78

#include<iostream>
#include<string>
using namespace std;

//-------------------------------------------------------------------------------------------------------------
int foo1(int a)
{
	return a - 1;
}
//-------------------------------------------------------------------------------------------------------------
int foo2(int a)
{
	return a * 2;
}
//-------------------------------------------------------------------------------------------------------------

//Функции ниже созданы для реализации примера необходимости приминения указателя.
//-------------------------------------------------------------------------------------------------------------
string GetDataFromBD()
{
	return "Data From BD";
}
//-------------------------------------------------------------------------------------------------------------
string GetDataFromWebServer()
{
	return "Data From WebServer";
}
//-------------------------------------------------------------------------------------------------------------
string GetDataAstral()
{
	return "Data Astral";
}
//-------------------------------------------------------------------------------------------------------------
void ShowInfo(string(*foo)())
{
	cout << foo() << endl;
}
//-------------------------------------------------------------------------------------------------------------
void main()
{
	setlocale(LC_ALL, "ru");

	cout << "====================================" << endl;
	cout << "Пример когда вызвали функцию через указатель с параметром данных string: " << endl;
	string(*sho)();
	sho = GetDataFromBD;
	cout << GetDataFromBD() << endl;

	cout << "====================================" << endl;
	cout << "Пример когда вызвали функцию используя функцию ShowInfo через указатель с параметром данных string: " << endl;
	ShowInfo(GetDataFromBD);
	ShowInfo(GetDataFromWebServer);
	ShowInfo(GetDataAstral);	

	cout << "====================================" << endl;
	cout << "Пример когда вызвали функцию через указатель с параметром данных int: " << endl;

	int(*fooPoint)(int a);

	fooPoint = foo1;
	cout << fooPoint(5) << endl;

	fooPoint = foo2;
	cout << fooPoint(5)  << endl;
}
//-------------------------------------------------------------------------------------------------------------

/*
Указатели на функцию удобен.
Функция ShowInfo, может благодаря этому принять любую другую созданную дополнительно функция, и её не надо будет
дописывать, она на данном примере сможет принять хоть 10 созданных функций с параметром string.

Также, на примере проинициализированного параметра int(*fooPoint)(int a); мы также получи доступ к функциям, с параметром
int, что даёт возможность рабоать с функцами данного типа сколько бы их небыло.

Реализациия вызова, може быть как через функцию где инициализировали указатель - void ShowInfo(string(*foo)()), или
проинициализировали переменную - string(*sho)(); Тоже самое инициализируеться с любыми другими параметрами.
*/